
&НаСервере
Процедура СформироватьВоронкуНаСервере()

    Макет = Отчеты.Дашборд.ПолучитьМакет("Макет");
	
	//Первый запрос
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
	|   lead_stages.stage КАК stage,
    |   КОЛИЧЕСТВО(*) КАК cnt
	|ИЗ
    |   РегистрСведений.lead_stages КАК lead_stages
	|ГДЕ
	|   lead_stages.entered_at МЕЖДУ &Начало И &Конец
    |СГРУППИРОВАТЬ ПО
    |   lead_stages.stage";
	
	Запрос.УстановитьПараметр("Начало", Начало);
    Запрос.УстановитьПараметр("Конец", Конец);
	
    Выборка = Запрос.Выполнить().Выбрать();
	
	
	
    // Количество по стадиям
    New1 = 0;
    Qualified = 0;
    Proposal = 0;
    Won = 0;
    Lost = 0;
	
		
	НашлисьДанные = Ложь;	
	Пока Выборка.Следующий() Цикл
		
		 НашлисьДанные = Истина;

        Если Выборка.stage = "new" Тогда
            New1 = Выборка.cnt;

        ИначеЕсли Выборка.stage = "qualified" Тогда
            Qualified = Выборка.cnt;

        ИначеЕсли Выборка.stage = "proposal" Тогда
            Proposal = Выборка.cnt;

        ИначеЕсли Выборка.stage = "won" Тогда
            Won = Выборка.cnt;

        ИначеЕсли Выборка.stage = "lost" Тогда
            Lost = Выборка.cnt;

        КонецЕсли;
	КонецЦикла;
	
	Если Не НашлисьДанные Тогда
    	Сообщить("За выбранный период данных нет");
    	Возврат;
	КонецЕсли;
	
	
	//Второй запрос Время
	Запрос2 = Новый Запрос;
	Запрос2.Текст =
	"ВЫБРАТЬ
	|   lead_stages.stage КАК stage,
	|   СРЕДНЕЕ(РАЗНОСТЬДАТ(lead_stages.entered_at, lead_stages.left_at, Час)) КАК AvgDuration
	|ИЗ
	|   РегистрСведений.lead_stages КАК lead_stages
	|ГДЕ
	|   lead_stages.entered_at МЕЖДУ &Начало И &Конец
	|   И lead_stages.left_at <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|СГРУППИРОВАТЬ ПО
	|   lead_stages.stage";

	Запрос2.УстановитьПараметр("Начало", Начало);
	Запрос2.УстановитьПараметр("Конец", Конец);

	Выборка2 = Запрос2.Выполнить().Выбрать();

	// Средняя длительность по стадиям
	AvgNew = 0;
	AvgQualified = 0;
	AvgProposal = 0;
	AvgWon = 0;
	AvgLost = 0;

	Пока Выборка2.Следующий() Цикл

	    Если Выборка2.stage = "new" Тогда
	        AvgNew = Выборка2.AvgDuration;

	    ИначеЕсли Выборка2.stage = "qualified" Тогда
	        AvgQualified = Выборка2.AvgDuration;

	    ИначеЕсли Выборка2.stage = "proposal" Тогда
	        AvgProposal = Выборка2.AvgDuration;

	    ИначеЕсли Выборка2.stage = "won" Тогда
	        AvgWon = Выборка2.AvgDuration;

	    ИначеЕсли Выборка2.stage = "lost" Тогда
	        AvgLost = Выборка2.AvgDuration;

	    КонецЕсли;

	КонецЦикла;
	
	//Воронка
    Данные = Новый Структура;
	Данные.Вставить("NewPercent", 100);
    Данные.Вставить("QualifiedPercent", (Qualified * 100.0) / New1);
    Данные.Вставить("ProposalPercent", (Proposal * 100.0) / New1);
    Данные.Вставить("WonPercent", (Won * 100.0) / New1);
    Данные.Вставить("LostPercent", (Lost * 100.0) / New1);
	//Конверсия
	ДанныеKPI = Новый Структура;
	ДанныеKPI.Вставить("NewConversion", (Qualified*100.0/New1));
	ДанныеKPI.Вставить("QualifiedConversion", (Proposal*100.0/Qualified));
	ДанныеKPI.Вставить("ProposalConversion", ((Won+Lost)*100.0/Proposal));
	ДанныеKPI.Вставить("WonConversion", ((Won)*100.0/Proposal));
	ДанныеKPI.Вставить("lostConversion", ((Lost)*100.0/Proposal));
	//Время
	ДанныеKPI.Вставить("NewLength", AvgNew);
	ДанныеKPI.Вставить("QualifiedLength", AvgQualified);
	ДанныеKPI.Вставить("ProposalLength", AvgProposal);
	ДанныеKPI.Вставить("WonLength", AvgWon);
	ДанныеKPI.Вставить("LostLength", AvgLost);
	

    // вывод
    ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
    ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
    ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	ОбластьДетальныхЗаписейKPI = Макет.ПолучитьОбласть("KPI");
    ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
    ТабДок.Очистить();
    ТабДок.Вывести(ОбластьЗаголовок);
    ТабДок.Вывести(ОбластьШапкаТаблицы);
	
    ОбластьДетальныхЗаписей.Параметры.Заполнить(Данные);
	ОбластьДетальныхЗаписейKPI.Параметры.Заполнить(ДанныеKPI);
	ТабДок.Вывести(ОбластьДетальныхЗаписей);
	ТабДок.Вывести(ОбластьДетальныхЗаписейKPI);
	
    ТабДок.Вывести(ОбластьПодвал);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьВоронкуПродаж(Команда)
	СформироватьВоронкуНаСервере();
КонецПроцедуры


