&НаКлиенте
Процедура СоздатьCSV(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
    Диалог.Заголовок = "Выберите папку для сохранения файла Leads.csv";
	
	Если НЕ Диалог.Выбрать() Тогда
        Сообщить("Выгрузка отменена.");
        Возврат;
    КонецЕсли;

    ИмяФайла = "Leads.csv";
    ПолныйПуть = Диалог.Каталог + "\" + ИмяФайла;

    ВыгрузитьВCSV(ПолныйПуть);
    
    Сообщить("Выгрузка завершена. Файл сохранён: " + ПолныйПуть);
	
КонецПроцедуры
	
&НаСервере
Процедура ВыгрузитьВCSV(ИмяФайлаCSV);
	 Разделитель = ",";
     ТаблицаЗначений = Получитьданные();
     Текст = СоздатьДанныеCSV(ТаблицаЗначений,разделитель);
     ЗаписатьCSV(Текст,ИмяФайлаCSV);
 КонецПроцедуры
 
 Функция Получитьданные()      	
        	Запрос = Новый Запрос;
        	Запрос.Текст =
                   	"ВЫБРАТЬ
                   	|       	leads.lead_id КАК lead_id,
                   	|       	leads.created_at КАК created_at,
                   	|       	leads.source КАК source,
                   	|       	leads.current_stage КАК current_stage,
					|			leads.manager КАК manager
                   	|ИЗ
                   	|       	Справочник.leads КАК leads";     	
        	РезультатЗапроса = Запрос.Выполнить().Выгрузить();  
        	Возврат РезультатЗапроса;
КонецФункции


Функция СоздатьЗаголовкиCSV(ТаблицаЗначений, Разделитель)

    ТекстЗаголовка = "";

    Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
        Если ТекстЗаголовка = "" Тогда
            ТекстЗаголовка = Колонка.Имя;
        Иначе
            ТекстЗаголовка = ТекстЗаголовка + Разделитель + Колонка.Имя;
        КонецЕсли;
    КонецЦикла;

    Возврат ТекстЗаголовка;

КонецФункции


Функция СоздатьДанныеCSV(ТаблицаЗначений,разделитель)
	Текст="";
	
	для каждого запись из ТаблицаЗначений Цикл
		если Текст="" тогда
		    Текст=СоздатьЗаголовкиCSV(ТаблицаЗначений,разделитель) + Символы.ПС;   	
		КонецЕсли;  
		Текст = Текст + запись.lead_id + разделитель + запись.created_at + разделитель + запись.source + разделитель + запись.current_stage + разделитель + запись.manager + Символы.ПС;         	
	КонецЦикла;
	Возврат текст;
КонецФункции


Процедура ЗаписатьCSV(текст,имяФайла)                 	
          кодировка = КодировкаТекста.UTF8;
          ТекстовыйФайлЗапись = Новый ЗаписьТекста(имяФайла,Кодировка);           
          ТекстовыйФайлЗапись.ЗаписатьСтроку(текст);
          ТекстовыйФайлЗапись.Закрыть();         	
КонецПроцедуры