Функция ПреобразоватьДатуИзCSV(Знач СтрДата) Экспорт
	Если СтрНайти(СтрДата, ".") Тогда
		Возврат Дата(СтрДата);
	Иначе
		СтрДата = СтрЗаменить(СтрДата, "T", "");
		СтрДата = СтрЗаменить(СтрДата, "-", "");
		СтрДата = СтрЗаменить(СтрДата, ":", "");
		Возврат Дата(СтрДата);
	КонецЕсли           
КонецФункции

Функция ОпределитьТипФайла(МассивЗаголовков) Экспорт

    Если МассивЗаголовков.Количество() = 2
       И МассивЗаголовков[0] = "code_name"
       И МассивЗаголовков[1] = "name" Тогда

        Возврат "sources";

    ИначеЕсли МассивЗаголовков.Количество() = 3
       И МассивЗаголовков[0] = "full_name"
       И МассивЗаголовков[1] = "email"
       И МассивЗаголовков[2] = "role" Тогда

        Возврат "employees";

    ИначеЕсли МассивЗаголовков.Количество() = 5
       И МассивЗаголовков[0] = "lead_id"
       И МассивЗаголовков[1] = "created_at"
       И МассивЗаголовков[2] = "source"
       И МассивЗаголовков[3] = "current_stage"
       И МассивЗаголовков[4] = "manager" Тогда

        Возврат "leads";

    ИначеЕсли МассивЗаголовков.Количество() = 4
       И МассивЗаголовков[0] = "lead_id"
       И МассивЗаголовков[1] = "stage"
       И МассивЗаголовков[2] = "entered_at"
       И МассивЗаголовков[3] = "left_at" Тогда

        Возврат "lead_stages";

    ИначеЕсли МассивЗаголовков.Количество() = 3
       И МассивЗаголовков[0] = "lead_id"
       И МассивЗаголовков[1] = "full_name"
       И МассивЗаголовков[2] = "email" Тогда

        Возврат "contacts";

    КонецЕсли;

    Возврат Неопределено;

КонецФункции

Функция ИмпортироватьCSV(ТекстCSV) Экспорт

    Текст = Новый ТекстовыйДокумент;
    Текст.УстановитьТекст(ТекстCSV);

    Если Текст.КоличествоСтрок() < 2 Тогда
        Возврат СформироватьОшибку(400, "INVALID", "Недостаточно данных в файле");
    КонецЕсли;

    // ----------------------------
    // Заголовок
    // ----------------------------

    СтрокаЗаголовок = Текст.ПолучитьСтроку(1);

    МассивЗаголовков = СтрРазделить(СтрокаЗаголовок,",",Ложь);

    Для Индекс = 0 По МассивЗаголовков.ВГраница() Цикл
        МассивЗаголовков[Индекс] = СокрЛП(МассивЗаголовков[Индекс]);
    КонецЦикла;

    ТипФайла = ОпределитьТипФайла(МассивЗаголовков);

    Если ТипФайла = Неопределено Тогда
        Возврат СформироватьОшибку(400, "INVALID", "Тип файла не определен");
    КонецЕсли;

    // ----------------------------
    // Импорт строк
    // ----------------------------

    Для НомерСтроки = 2 По Текст.КоличествоСтрок() Цикл

        ТекущаяСтрока = Текст.ПолучитьСтроку(НомерСтроки);

        Если ПустаяСтрока(ТекущаяСтрока) Тогда
            Продолжить;
        КонецЕсли;

        МассивЭлементов = СтрРазделить(ТекущаяСтрока,",",Ложь);

        Если МассивЭлементов.Количество()<>МассивЗаголовков.Количество() Тогда
		    Продолжить;
        КонецЕсли;

        // ----------------------------
        // SOURCES
        // ----------------------------

        Если ТипФайла = "sources" Тогда

            ИмпортSources(МассивЭлементов);

        // ----------------------------
        // EMPLOYEES
        // ----------------------------

        ИначеЕсли ТипФайла = "employees" Тогда

            ИмпортEmployees(МассивЭлементов);

        // ----------------------------
        // LEADS
        // ----------------------------

        ИначеЕсли ТипФайла = "leads" Тогда

            ИмпортLeads(МассивЭлементов);

        // ----------------------------
        // LEAD STAGES
        // ----------------------------

        ИначеЕсли ТипФайла = "lead_stages" Тогда

            ИмпортLeadStages(МассивЭлементов);

        // ----------------------------
        // CONTACTS
        // ----------------------------

        ИначеЕсли ТипФайла = "contacts" Тогда

            ИмпортContacts(МассивЭлементов);

        КонецЕсли;

    КонецЦикла;

    Возврат Истина;

КонецФункции


Процедура ИмпортSources(МассивЭлементов) Экспорт

    code_name = СокрЛП(МассивЭлементов[0]);
    name = СокрЛП(МассивЭлементов[1]);

    Найденный = Справочники.sources.НайтиПоКоду(code_name);

    Если Найденный <> Справочники.sources.ПустаяСсылка() Тогда
        Возврат;
    КонецЕсли;

    НовыйЭл = Справочники.sources.СоздатьЭлемент();

    НовыйЭл.Наименование = code_name;
    НовыйЭл.code_name = code_name;
    НовыйЭл.name = name;

    НовыйЭл.Записать();

КонецПроцедуры

Процедура ИмпортEmployees(МассивЭлементов) Экспорт

    full_name = СокрЛП(МассивЭлементов[0]);
    email = СокрЛП(МассивЭлементов[1]);
    role = СокрЛП(МассивЭлементов[2]);

    // Проверка существования по email
    Найденный = Справочники.employees.НайтиПоРеквизиту("email",email);

    Если Найденный <> Справочники.employees.ПустаяСсылка() Тогда
        Возврат;
    КонецЕсли;

    // Определение перечисления
    Попытка
        СсылкаНаРоль = Перечисления.Роли[role];
    Исключение
        СсылкаНаРоль = Перечисления.Роли.ПустаяСсылка();
    КонецПопытки;

    НовыйЭл = Справочники.employees.СоздатьЭлемент();

    НовыйЭл.Наименование = email;
    НовыйЭл.full_name = full_name;
    НовыйЭл.email = email;
    НовыйЭл.role = СсылкаНаРоль;

    НовыйЭл.Записать();

КонецПроцедуры

Процедура ИмпортContacts(МассивЭлементов) Экспорт

    lead_id = Число(СокрЛП(МассивЭлементов[0]));
    full_name = СокрЛП(МассивЭлементов[1]);
    email = СокрЛП(МассивЭлементов[2]);

    // Ищем лид
    СсылкаНаЛид = Справочники.leads.НайтиПоРеквизиту("lead_id",lead_id);

    Если СсылкаНаЛид = Справочники.leads.ПустаяСсылка() Тогда
        Возврат;
    КонецЕсли;

    // Проверка дубля
	Найденный = Справочники.contacts.НайтиПоРеквизиту("lead_id",СсылкаНаЛид);

    Если Найденный <> Справочники.contacts.ПустаяСсылка() Тогда
        Возврат;
	КонецЕсли;
	
    // Создание контакта
    НовыйКонтакт = Справочники.contacts.СоздатьЭлемент();

    НовыйКонтакт.ОбменДанными.Загрузка = Истина;

    НовыйКонтакт.lead_id = СсылкаНаЛид;
    НовыйКонтакт.full_name = full_name;
    НовыйКонтакт.email = email;

    НовыйКонтакт.Наименование = full_name;

    НовыйКонтакт.Записать();

КонецПроцедуры

Процедура ИмпортLeads(МассивЭлементов) Экспорт

    lead_id = Число(СокрЛП(МассивЭлементов[0]));
    created_at = ПреобразоватьДатуИзCSV(МассивЭлементов[1]);
    source = СокрЛП(МассивЭлементов[2]);
    current_stage = СокрЛП(МассивЭлементов[3]);
    manager = СокрЛП(МассивЭлементов[4]);

    // Проверка дубля
    Найденный = Справочники.leads.НайтиПоРеквизиту("lead_id",lead_id);

    Если Найденный <> Справочники.leads.ПустаяСсылка() Тогда
        Возврат;
    КонецЕсли;

    // Источник
    СсылкаНаИсточник = Справочники.sources.НайтиПоНаименованию(source);

    // Менеджер
    СсылкаНаМенеджера = Справочники.employees.НайтиПоРеквизиту("full_name", manager);

    // Стадия
    Попытка
        СсылкаНаСтадию = Перечисления.Стадии[current_stage];
    Исключение
        СсылкаНаСтадию = Перечисления.Стадии.ПустаяСсылка();
    КонецПопытки;

    // Создание лида
    НовыйЛид = Справочники.leads.СоздатьЭлемент();

    НовыйЛид.ОбменДанными.Загрузка = Истина;

    НовыйЛид.lead_id = lead_id;
    НовыйЛид.created_at = created_at;
    НовыйЛид.source = СсылкаНаИсточник;
    НовыйЛид.current_stage = СсылкаНаСтадию;
    НовыйЛид.manager = СсылкаНаМенеджера;

    НовыйЛид.Наименование = lead_id;
    НовыйЛид.Код = lead_id;

    НовыйЛид.Записать();

КонецПроцедуры

Процедура ИмпортLeadStages(МассивЭлементов) Экспорт

    lead_id = Число(СокрЛП(МассивЭлементов[0]));
    stage = СокрЛП(МассивЭлементов[1]);
    entered_at = ПреобразоватьДатуИзCSV(МассивЭлементов[2]);
    left_at = ПреобразоватьДатуИзCSV(МассивЭлементов[3]);

    // Ищем лид
    СсылкаНаЛид = Справочники.leads.НайтиПоРеквизиту("lead_id",lead_id);

    Если СсылкаНаЛид = Справочники.leads.ПустаяСсылка() Тогда
        Возврат;
    КонецЕсли;

    // Проверка дубля
    Проверка = РегистрыСведений.lead_stages.СоздатьНаборЗаписей();

    Проверка.Отбор.lead_id.Установить(СсылкаНаЛид);
    Проверка.Отбор.stage.Установить(stage);

    Проверка.Прочитать();

    Если Проверка.Количество() > 0 Тогда
        Возврат;
    КонецЕсли;

    // Создание записи
    НаборЗаписей = РегистрыСведений.lead_stages.СоздатьНаборЗаписей();

    НоваяЗапись = НаборЗаписей.Добавить();

    НоваяЗапись.lead_id = СсылкаНаЛид;
    НоваяЗапись.stage = stage;

    НоваяЗапись.entered_at = entered_at;
    НоваяЗапись.left_at = left_at;
	НоваяЗапись.manager_name = СсылкаНаЛид.manager;

    НаборЗаписей.Записать();

КонецПроцедуры