//Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//    // Проверка уникальности name
//    Если ЗначениеЗаполнено(name) Тогда
//        Запрос = Новый Запрос;
//        Запрос.Текст = 
//        "ВЫБРАТЬ
//        |   sources.Ссылка
//        |ИЗ
//        |   Справочник.sources КАК sources
//        |ГДЕ
//        |   sources.name = &name
//		|   И sources.Ссылка <> &ТекущийЭлемент";
//        
//        Запрос.УстановитьПараметр("name", name);
//        Запрос.УстановитьПараметр("ТекущийЭлемент", Ссылка);
//        
//        Результат = Запрос.Выполнить();
//        Выборка = Результат.Выбрать();
//        Если Выборка.Следующий() Тогда
//            Сообщение = Новый СообщениеПользователю;
//            Сообщение.Текст = "name с таким значением уже существует!";
//            Сообщение.Поле = "name";  // подсветит поле на форме
//            Сообщение.Сообщить();
//            Отказ = Истина;
//            Возврат;
//        КонецЕсли;
//    КонецЕсли;
//КонецПроцедуры